; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v5)
		(pred_1 ?v1)
		(pred_4 ?v8)
		(pred_6 ?v8)
		(pred_2 ?v1 ?v8)
		(pred_3)
		(pred_5 ?v1))

   (:action op_3
       :parameters  (?v6 ?v7)
       :precondition (and (not-eq ?v6 ?v7) 
                          (pred_4 ?v6) (pred_4 ?v7) (pred_6 ?v6))
       :effect (and  (pred_6 ?v7)
		     (not (pred_6 ?v6))))


   (:action op_1
       :parameters (?v2 ?v4)
       :precondition  (and  (pred_1 ?v2) (pred_4 ?v4)
			    (pred_2 ?v2 ?v4) (pred_6 ?v4) (pred_3))
       :effect (and (pred_5 ?v2)
		    (not (pred_2 ?v2 ?v4)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v2  ?v4)
       :precondition  (and  (pred_1 ?v2) (pred_4 ?v4)
			    (pred_5 ?v2) (pred_6 ?v4))
       :effect (and (pred_2 ?v2 ?v4)
		    (pred_3)
		    (not (pred_5 ?v2)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_03 obj_02 obj_01 
          obj_05 obj_04 
)
(:init
(pred_4 obj_03)
(pred_4 obj_02)
(pred_4 obj_01)
(pred_1 obj_05)
(pred_1 obj_04)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(pred_3)
(pred_2 obj_05 obj_02)
(pred_2 obj_04 obj_01)
(pred_6 obj_01)
)
(:goal
(and
(pred_2 obj_05 obj_03)
(pred_2 obj_04 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_05 obj_03) (pred_6 obj_01))
    (sometime-before  (pred_2 obj_04 obj_02) (pred_6 obj_03))
  )
)
)

; plan
1. (op_1 obj_04 obj_01)
   deleted: (pred_2 obj_04 obj_01) (pred_3)
   added: (pred_5 obj_04)
   goals met: 0 of 2
2. (op_3 obj_01 obj_02)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_02)
   goals met: 0 of 2
3. (op_3 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_03)
   goals met: 0 of 2
4. (op_2 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_2 obj_04 obj_03) (pred_3)
   goals met: 0 of 2
5. (op_3 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_02)
   goals met: 0 of 2
6. (op_1 obj_05 obj_02)
   deleted: (pred_2 obj_05 obj_02) (pred_3)
   added: (pred_5 obj_05)
   goals met: 0 of 2
7. (op_3 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_03)
   goals met: 0 of 2
8. (op_2 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_2 obj_05 obj_03) (pred_3)
   goals met: 1 of 2
9. (op_1 obj_04 obj_03)
   deleted: (pred_2 obj_04 obj_03) (pred_3)
   added: (pred_5 obj_04)
   goals met: 1 of 2
10. (op_3 obj_03 obj_02)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_02)
   goals met: 1 of 2
11. (op_2 obj_04 obj_02)
   deleted: (pred_5 obj_04)
   added: (pred_2 obj_04 obj_02) (pred_3)
   goals met: 2 of 2
